# Pandas - Week 11

***

# Agregasi pada banyak kolom Data Frame dengan `agg()`

## Import modules

In [3]:
import pandas as pd

## Persiapan Data Frame

In [4]:
df = pd.read_csv('./data/titanicfull.csv')
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

## Menerapkan agregasi pada sejumlah kolom dengan `agg()`

In [7]:
df.groupby('pclass').agg({'pclass':'count', 
                           'age':['mean', 'max'], 
                          'survived':'mean'})

       pclass        age        survived
        count       mean   max      mean
pclass
1         323  39.159930  80.0  0.619195
2         277  29.506705  70.0  0.429603
3         709  24.816367  74.0  0.255289

Pada kode di atas, akan dilakukan pengelompokkan berdasarkan `pclass`. Setelahnya, digunakan fungsi `agg` yang akan menerima parameter berupa dictionary. **Key** dari dictionary tersebut menunjukkan kolom yang akan dikenakan fungsi agregasi, dan **Value**-nya menunjukkan fungsi agregasi apa yang akan digunakan untuk kolom tersebut.

Pada kasus ini, kolom `pclass` akan dikenakan fungsi agregasi `count`, kolom `age` akan dikenakan fungsi `mean` dan `max`, dan kolom `survived` akan dikenakan fungsi `mean`.

In [11]:
df.groupby('pclass').agg(n_pass=('pclass','count'), 
                           avg_age=('age', 'mean'),
                          max_age=('age', 'max'),
                          survival_rate=('survived','mean'))

        n_pass    avg_age  max_age  survival_rate
pclass
1          323  39.159930     80.0       0.619195
2          277  29.506705     70.0       0.429603
3          709  24.816367     74.0       0.255289

Kode di atas menunjukkan penggunaan nama kolom yang lebih representatif dengan nilai yang ditunjukkan. Method yang digunakan masih method `agg` dan dilanjutkan dengan menspesifikasikan parameternya dengan format berikut: `{nama kolom}=('nama_kolom', 'fungsi agregasi')`